# Bureau of Labor Statistics
https://www.bls.gov/oes/about_charts.htm

## EDA

In [1]:
import pandas as pd
import numpy as np

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [3]:
df = pd.read_excel('/content/MSA_M2019_dl.xlsx')

In [4]:
print(df.shape)
df.head()

(142410, 30)

    area   area_title  area_type  naics  ... a_pct75 a_pct90  annual hourly
0  10180  Abilene, TX          4      0  ...   50030   73230     NaN    NaN
1  10180  Abilene, TX          4      0  ...  107910  157190     NaN    NaN
2  10180  Abilene, TX          4      0  ...  106870  154520     NaN    NaN
3  10180  Abilene, TX          4      0  ...  155050  207570     NaN    NaN
4  10180  Abilene, TX          4      0  ...       *       *     NaN    NaN

[5 rows x 30 columns]

In [5]:
df.dtypes

area              int64
area_title       object
area_type         int64
naics             int64
naics_title      object
i_group          object
own_code          int64
occ_code         object
occ_title        object
o_group          object
tot_emp          object
emp_prse         object
jobs_1000        object
loc_quotient     object
pct_total       float64
h_mean           object
a_mean           object
mean_prse        object
h_pct10          object
h_pct25          object
h_median         object
h_pct75          object
h_pct90          object
a_pct10          object
a_pct25          object
a_median         object
a_pct75          object
a_pct90          object
annual           object
hourly           object
dtype: object

## Data Cleaning

In [6]:
# Dropping pct_total, annual, and hourly
# Majority is empty
bls_m2019 = df.copy()
bls_m2019 = bls_m2019.dropna(axis=1)

In [7]:
print(bls_m2019.shape)
bls_m2019.head()

(142410, 27)

    area   area_title  area_type  naics  ... a_pct25 a_median  a_pct75 a_pct90
0  10180  Abilene, TX          4      0  ...   22810    32530    50030   73230
1  10180  Abilene, TX          4      0  ...   56610    78030   107910  157190
2  10180  Abilene, TX          4      0  ...   50350    73850   106870  154520
3  10180  Abilene, TX          4      0  ...   72140   119920   155050  207570
4  10180  Abilene, TX          4      0  ...       *        *        *       *

[5 rows x 27 columns]

Did this exploration after dropping NaN

In [8]:
bls_m2019.describe(exclude='number')

                                   area_title     naics_title  ... a_pct75 a_pct90
count                                  142410          142410  ...  142410  142410
unique                                    396               1  ...   14786   16865
top     New York-Newark-Jersey City, NY-NJ-PA  Cross-industry  ...       *       #
freq                                      759          142410  ...    2652    3977

[4 rows x 23 columns]

In [9]:
bls_m2019.describe()

                area  area_type     naics  own_code
count  142410.000000   142410.0  142410.0  142410.0
mean    32528.190506        4.0       0.0    1235.0
std     15255.350647        0.0       0.0       0.0
min     10180.000000        4.0       0.0    1235.0
25%     20220.000000        4.0       0.0    1235.0
50%     31080.000000        4.0       0.0    1235.0
75%     41620.000000        4.0       0.0    1235.0
max     79600.000000        4.0       0.0    1235.0

In [10]:
bls_m2019['area_title'].nunique()

396

In [11]:
bls_m2019.sort_values(['area_title', 'loc_quotient'], ascending=False)

         area   area_title  area_type  naics  ... a_pct25 a_median  a_pct75 a_pct90
133989  49740     Yuma, AZ          4      0  ...   63370    98340   143280  162140
134049  49740     Yuma, AZ          4      0  ...   26280    29040    33260   37250
134065  49740     Yuma, AZ          4      0  ...   76870   122310   153800  176010
134069  49740     Yuma, AZ          4      0  ...  130600        #        #       #
134071  49740     Yuma, AZ          4      0  ...   65890    83650    93370   99180
...       ...          ...        ...    ...  ...     ...      ...      ...     ...
25      10180  Abilene, TX          4      0  ...   59600    75830    95190  123270
37      10180  Abilene, TX          4      0  ...   47350    59840    81200   97580
17      10180  Abilene, TX          4      0  ...   67050    87160   105850  152710
42      10180  Abilene, TX          4      0  ...   62440    84980   109430  138190
257     10180  Abilene, TX          4      0  ...   21700    27500    34920   39590

[142410 rows x 27 columns]

In [12]:
# Clean up loc_quotient
bls_m2019['loc_quotient'] = bls_m2019['loc_quotient'].replace('**', '0')
bls_m2019['loc_quotient'] = bls_m2019['loc_quotient'].astype(float)

In [13]:
# Clean up jobs_1000
bls_m2019["jobs_1000"] = bls_m2019['jobs_1000'].replace("**","0")
bls_m2019["jobs_1000"] = bls_m2019['jobs_1000'].astype(float)

In [14]:
# Clean up h_mean
# replacing *, #'s with 0's for now -> will calculate after cleaning
bls_m2019['h_mean'] = bls_m2019['h_mean'].replace("*","0")
bls_m2019['h_mean'] = bls_m2019['h_mean'].replace("#","0")
bls_m2019['h_mean'] = bls_m2019['h_mean'].astype(float)

In [15]:
# Clean up a_mean
bls_m2019['a_mean'] = bls_m2019['a_mean'].replace("*","0")
bls_m2019['a_mean'] = bls_m2019['a_mean'].replace("#","0")
bls_m2019['a_mean'] = bls_m2019['a_mean'].astype(int)

## Feature Engineering

In [16]:
# We do not need all the columns so I will compress the df to just the necessary columns
bls = bls_m2019[['area_title', 'occ_title', 'jobs_1000', 'loc_quotient', 'h_mean', 'a_mean']]

In [17]:
# For readability
bls = bls.rename(columns = {
    'h_mean': 'avg_hourly_salary',
    'a_mean': 'avg_annual_salary'
})

In [18]:
# Creating a city and state columns for easier manipulation and joining with other tables
states = []
cities = []

for row in bls_m2019['area_title']:
  row = row.split(',')
  cities.append(row[0])
  states.append(row[1])

bls['city'] = cities
bls['state'] = states

In [19]:
print(bls.shape)
bls.head()

(142410, 8)

    area_title                                  occ_title  ...     city  state
0  Abilene, TX                            All Occupations  ...  Abilene     TX
1  Abilene, TX                     Management Occupations  ...  Abilene     TX
2  Abilene, TX            General and Operations Managers  ...  Abilene     TX
3  Abilene, TX                             Sales Managers  ...  Abilene     TX
4  Abilene, TX  Public Relations and Fundraising Managers  ...  Abilene     TX

[5 rows x 8 columns]

In [20]:
# Checking column types after revision
bls.dtypes

area_title            object
occ_title             object
jobs_1000            float64
loc_quotient         float64
avg_hourly_salary    float64
avg_annual_salary      int64
city                  object
state                 object
dtype: object

In [21]:
bls.isnull().sum()

area_title           0
occ_title            0
jobs_1000            0
loc_quotient         0
avg_hourly_salary    0
avg_annual_salary    0
city                 0
state                0
dtype: int64

In [22]:
# Reorder df, also do not need area_tile (redundant)
bls = bls[['state', 'city', 'occ_title', 'jobs_1000', 'loc_quotient', 'avg_hourly_salary', 'avg_annual_salary']]

In [23]:
bls.loc[(bls.city =='Urban Honolulu'), 'city'] = 'Honolulu'

In [24]:
bls.loc[(bls.city == 'Honolulu')][0:1]

       state      city  ... avg_hourly_salary  avg_annual_salary
124580    HI  Honolulu  ...             27.43              57060

[1 rows x 7 columns]

### Calculate Annual Wage
- using hourly wage 
(assumption - 40 hours * 52 weeks)

In [25]:
bls['avg_annual_salary'] = np.where(bls['avg_annual_salary']== 0, bls['avg_hourly_salary']*40*52, bls['avg_annual_salary'] )

#### Check if columns to see if formula is applied properly

In [26]:
14.07*40*52

29265.6

In [27]:
assert bls['avg_annual_salary'][1290] == 29265.6

In [28]:
bls.loc[
        (bls.city == 'Albany')
        & (bls.occ_title == 'Musicians and Singers')]

     state    city  ... avg_hourly_salary  avg_annual_salary
1290    OR  Albany  ...             14.07            29265.6

[1 rows x 7 columns]

In [29]:
20.97*40*52

43617.6

In [30]:
assert bls['avg_annual_salary'][1691] == 43617.6

In [31]:

bls.loc[
        (bls.city == 'Albany-Schenectady-Troy')
        & (bls.occ_title == 'Miscellaneous Entertainers and Performers, Sports and Related Workers')]

     state                     city  ... avg_hourly_salary  avg_annual_salary
1691    NY  Albany-Schenectady-Troy  ...             20.97            43617.6

[1 rows x 7 columns]

In [32]:
26.23*40*52

54558.4

In [33]:
assert bls['avg_annual_salary'][8367] == 54558.4

In [34]:
bls.loc[
        (bls.city == 'Austin-Round Rock')
        & (bls.occ_title == 'Musicians and Singers')]

     state               city  ... avg_hourly_salary  avg_annual_salary
8367    TX  Austin-Round Rock  ...             26.23            54558.4

[1 rows x 7 columns]

In [35]:
bls.loc[
        (bls.city == 'Denver-Aurora-Lakewood')
        & (bls.occ_title == 'Actors')]

      state                    city  ... avg_hourly_salary  avg_annual_salary
33443    CO  Denver-Aurora-Lakewood  ...              33.1            68848.0

[1 rows x 7 columns]

## Calculate Hourly Wage
- use annual wage(assumption - /40 and /52)

In [36]:
bls['avg_hourly_salary'] = np.where(bls['avg_hourly_salary']== 0, bls['avg_annual_salary']/(40*52), bls['avg_hourly_salary'] )

#### Check if columns to see if formula is applied properly

In [37]:
17400.0/(40*52)

8.365384615384615

In [38]:
assert bls['avg_hourly_salary'][103837] == 8.365384615384615

In [39]:
bls.loc[
        (bls.city == 'St. George')
        & (bls.occ_title == 'Legislators')]

       state        city  ... avg_hourly_salary  avg_annual_salary
103837    UT  St. George  ...          8.365385            17400.0

[1 rows x 7 columns]

In [40]:
51870.0/(40*52)

24.9375

In [41]:
assert bls['avg_hourly_salary'][21409]==24.9375

In [42]:
bls.loc[
        (bls.city == 'Charlotte-Concord-Gastonia')
        & (bls.occ_title == 'Special Education Teachers, Kindergarten and Elementary School')]

        state                        city  ... avg_hourly_salary  avg_annual_salary
21409   NC-SC  Charlotte-Concord-Gastonia  ...           24.9375            51870.0

[1 rows x 7 columns]

In [43]:
92190/(40*52)

44.32211538461539

In [44]:
assert bls['avg_hourly_salary'][17786]==44.32211538461539

In [45]:
bls.loc[
        (bls.city == 'Canton-Massillon')
        & (bls.occ_title == 'Chemistry Teachers, Postsecondary')]

      state              city  ... avg_hourly_salary  avg_annual_salary
17786    OH  Canton-Massillon  ...         44.322115            92190.0

[1 rows x 7 columns]

## Save modified df

In [46]:
bls.to_csv('bls.csv')

In [49]:
!cp bls.csv "drive/My Drive/"